src/main/resources/request-veraz/request-etapa2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <ns3:mensajeRequest xmlns="http://request.model.idvalidator.veraz.com/xsd" xmlns:ns2="http://model.idvalidator.veraz.com/xsd" xmlns:ns3="http://webservices.idvalidator.veraz.com">
         <ns3:identificador>
            <autorizacion>0</autorizacion>
            <lote>201123303123031</lote>
            <producto>ETAPA2</producto>
            <userLogon>
               <cliente/>
               <matriz>VN35987</matriz>
               <password>123451234512345ASDFGHJKL12345</password>
               <sector>03</sector>
               <sucursal>0</sucursal>
               <usuario>ID4LPO_XML</usuario>
            </userLogon>
         </ns3:identificador>
         <ns3:respuestas>
            <integrante>
               <valor>1</valor>
               <variables>
                  <cuestionario>11</cuestionario>
                  <respuesta>
                     <id_pregunta>171</id_pregunta>
                     <id_respuesta>0</id_respuesta>
                  </respuesta>
                  <respuesta>
                     <id_pregunta>172</id_pregunta>
                     <id_respuesta>1</id_respuesta>
                  </respuesta>
                  <respuesta>
                     <id_pregunta>179</id_pregunta>
                     <id_respuesta>1</id_respuesta>
                  </respuesta>
                  <respuesta>
                     <id_pregunta>190</id_pregunta>
                     <id_respuesta>1</id_respuesta>
                  </respuesta>
                  <respuesta>
                     <id_pregunta>184</id_pregunta>
                     <id_respuesta>1</id_respuesta>
                  </respuesta>
               </variables>
            </integrante>
         </ns3:respuestas>
      </ns3:mensajeRequest>
   </soapenv:Body>
</soapenv:Envelope>